Infineon/AURIX_code_examples/code_examples/OneEye_DAS_Shell_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxDma_reg.h
/** \brief 2874, DMARAM Channel 67 Configuration Register */
#define DMA_CH67_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012874u)
/** Alias (User Manual Name) for DMA_CH67_CHCFGR.
* To use register names with standard convension, please use DMA_CH67_CHCFGR.
*/
#define DMA_CHCFGR067 (DMA_CH67_CHCFGR)

/** \brief 2878, DMARAM Channel 67 Shadow Address Register */
#define DMA_CH67_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012878u)
/** Alias (User Manual Name) for DMA_CH67_SHADR.
* To use register names with standard convension, please use DMA_CH67_SHADR.
*/
#define DMA_SHADR067 (DMA_CH67_SHADR)

/** \brief 287C, DMARAM Channel 67 Control and Status Register */
#define DMA_CH67_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001287Cu)
/** Alias (User Manual Name) for DMA_CH67_CHCSR.
* To use register names with standard convension, please use DMA_CH67_CHCSR.
*/
#define DMA_CHCSR067 (DMA_CH67_CHCSR)

/** \brief 2880, DMARAM Channel 68 Read Data CRC Register */
#define DMA_CH68_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012880u)
/** Alias (User Manual Name) for DMA_CH68_RDCRCR.
* To use register names with standard convension, please use DMA_CH68_RDCRCR.
*/
#define DMA_RDCRCR068 (DMA_CH68_RDCRCR)

/** \brief 2884, DMARAM Channel 68 Source and Destination Address CRC Register */
#define DMA_CH68_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012884u)
/** Alias (User Manual Name) for DMA_CH68_SDCRCR.
* To use register names with standard convension, please use DMA_CH68_SDCRCR.
*/
#define DMA_SDCRCR068 (DMA_CH68_SDCRCR)

/** \brief 2888, DMARAM Channel 68 Source Address Register */
#define DMA_CH68_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012888u)
/** Alias (User Manual Name) for DMA_CH68_SADR.
* To use register names with standard convension, please use DMA_CH68_SADR.
*/
#define DMA_SADR068 (DMA_CH68_SADR)

/** \brief 288C, DMARAM Channel 68 Destination Address Register */
#define DMA_CH68_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001288Cu)
/** Alias (User Manual Name) for DMA_CH68_DADR.
* To use register names with standard convension, please use DMA_CH68_DADR.
*/
#define DMA_DADR068 (DMA_CH68_DADR)

/** \brief 2890, DMARAM Channel 68 Address and Interrupt Control Register */
#define DMA_CH68_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012890u)
/** Alias (User Manual Name) for DMA_CH68_ADICR.
* To use register names with standard convension, please use DMA_CH68_ADICR.
*/
#define DMA_ADICR068 (DMA_CH68_ADICR)

/** \brief 2894, DMARAM Channel 68 Configuration Register */
#define DMA_CH68_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012894u)
/** Alias (User Manual Name) for DMA_CH68_CHCFGR.
* To use register names with standard convension, please use DMA_CH68_CHCFGR.
*/
#define DMA_CHCFGR068 (DMA_CH68_CHCFGR)

/** \brief 2898, DMARAM Channel 68 Shadow Address Register */
#define DMA_CH68_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012898u)
/** Alias (User Manual Name) for DMA_CH68_SHADR.
* To use register names with standard convension, please use DMA_CH68_SHADR.
*/
#define DMA_SHADR068 (DMA_CH68_SHADR)

/** \brief 289C, DMARAM Channel 68 Control and Status Register */
#define DMA_CH68_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF001289Cu)
/** Alias (User Manual Name) for DMA_CH68_CHCSR.
* To use register names with standard convension, please use DMA_CH68_CHCSR.
*/
#define DMA_CHCSR068 (DMA_CH68_CHCSR)

/** \brief 28A0, DMARAM Channel 69 Read Data CRC Register */
#define DMA_CH69_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00128A0u)
/** Alias (User Manual Name) for DMA_CH69_RDCRCR.
* To use register names with standard convension, please use DMA_CH69_RDCRCR.
*/
#define DMA_RDCRCR069 (DMA_CH69_RDCRCR)

/** \brief 28A4, DMARAM Channel 69 Source and Destination Address CRC Register */
#define DMA_CH69_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00128A4u)
/** Alias (User Manual Name) for DMA_CH69_SDCRCR.
* To use register names with standard convension, please use DMA_CH69_SDCRCR.
*/
#define DMA_SDCRCR069 (DMA_CH69_SDCRCR)

/** \brief 28A8, DMARAM Channel 69 Source Address Register */
#define DMA_CH69_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00128A8u)
/** Alias (User Manual Name) for DMA_CH69_SADR.
* To use register names with standard convension, please use DMA_CH69_SADR.
*/
#define DMA_SADR069 (DMA_CH69_SADR)

/** \brief 28AC, DMARAM Channel 69 Destination Address Register */
#define DMA_CH69_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00128ACu)
/** Alias (User Manual Name) for DMA_CH69_DADR.
* To use register names with standard convension, please use DMA_CH69_DADR.
*/
#define DMA_DADR069 (DMA_CH69_DADR)

/** \brief 28B0, DMARAM Channel 69 Address and Interrupt Control Register */
#define DMA_CH69_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00128B0u)
/** Alias (User Manual Name) for DMA_CH69_ADICR.
* To use register names with standard convension, please use DMA_CH69_ADICR.
*/
#define DMA_ADICR069 (DMA_CH69_ADICR)

/** \brief 28B4, DMARAM Channel 69 Configuration Register */
#define DMA_CH69_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00128B4u)
/** Alias (User Manual Name) for DMA_CH69_CHCFGR.
* To use register names with standard convension, please use DMA_CH69_CHCFGR.
*/
#define DMA_CHCFGR069 (DMA_CH69_CHCFGR)

/** \brief 28B8, DMARAM Channel 69 Shadow Address Register */
#define DMA_CH69_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00128B8u)
/** Alias (User Manual Name) for DMA_CH69_SHADR.
* To use register names with standard convension, please use DMA_CH69_SHADR.
*/
#define DMA_SHADR069 (DMA_CH69_SHADR)

/** \brief 28BC, DMARAM Channel 69 Control and Status Register */
#define DMA_CH69_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00128BCu)
/** Alias (User Manual Name) for DMA_CH69_CHCSR.
* To use register names with standard convension, please use DMA_CH69_CHCSR.
*/
#define DMA_CHCSR069 (DMA_CH69_CHCSR)

/** \brief 28C0, DMARAM Channel 70 Read Data CRC Register */
#define DMA_CH70_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00128C0u)
/** Alias (User Manual Name) for DMA_CH70_RDCRCR.
* To use register names with standard convension, please use DMA_CH70_RDCRCR.
*/
#define DMA_RDCRCR070 (DMA_CH70_RDCRCR)

/** \brief 28C4, DMARAM Channel 70 Source and Destination Address CRC Register */
#define DMA_CH70_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00128C4u)
/** Alias (User Manual Name) for DMA_CH70_SDCRCR.
* To use register names with standard convension, please use DMA_CH70_SDCRCR.
*/
#define DMA_SDCRCR070 (DMA_CH70_SDCRCR)

/** \brief 28C8, DMARAM Channel 70 Source Address Register */
#define DMA_CH70_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00128C8u)
/** Alias (User Manual Name) for DMA_CH70_SADR.
* To use register names with standard convension, please use DMA_CH70_SADR.
*/
#define DMA_SADR070 (DMA_CH70_SADR)

