Infineon/AURIX_code_examples/code_examples/OneEye_DAS_Shell_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxDma_reg.h
/** \brief 28CC, DMARAM Channel 70 Destination Address Register */
#define DMA_CH70_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00128CCu)
/** Alias (User Manual Name) for DMA_CH70_DADR.
* To use register names with standard convension, please use DMA_CH70_DADR.
*/
#define DMA_DADR070 (DMA_CH70_DADR)

/** \brief 28D0, DMARAM Channel 70 Address and Interrupt Control Register */
#define DMA_CH70_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00128D0u)
/** Alias (User Manual Name) for DMA_CH70_ADICR.
* To use register names with standard convension, please use DMA_CH70_ADICR.
*/
#define DMA_ADICR070 (DMA_CH70_ADICR)

/** \brief 28D4, DMARAM Channel 70 Configuration Register */
#define DMA_CH70_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00128D4u)
/** Alias (User Manual Name) for DMA_CH70_CHCFGR.
* To use register names with standard convension, please use DMA_CH70_CHCFGR.
*/
#define DMA_CHCFGR070 (DMA_CH70_CHCFGR)

/** \brief 28D8, DMARAM Channel 70 Shadow Address Register */
#define DMA_CH70_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00128D8u)
/** Alias (User Manual Name) for DMA_CH70_SHADR.
* To use register names with standard convension, please use DMA_CH70_SHADR.
*/
#define DMA_SHADR070 (DMA_CH70_SHADR)

/** \brief 28DC, DMARAM Channel 70 Control and Status Register */
#define DMA_CH70_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00128DCu)
/** Alias (User Manual Name) for DMA_CH70_CHCSR.
* To use register names with standard convension, please use DMA_CH70_CHCSR.
*/
#define DMA_CHCSR070 (DMA_CH70_CHCSR)

/** \brief 28E0, DMARAM Channel 71 Read Data CRC Register */
#define DMA_CH71_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF00128E0u)
/** Alias (User Manual Name) for DMA_CH71_RDCRCR.
* To use register names with standard convension, please use DMA_CH71_RDCRCR.
*/
#define DMA_RDCRCR071 (DMA_CH71_RDCRCR)

/** \brief 28E4, DMARAM Channel 71 Source and Destination Address CRC Register */
#define DMA_CH71_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF00128E4u)
/** Alias (User Manual Name) for DMA_CH71_SDCRCR.
* To use register names with standard convension, please use DMA_CH71_SDCRCR.
*/
#define DMA_SDCRCR071 (DMA_CH71_SDCRCR)

/** \brief 28E8, DMARAM Channel 71 Source Address Register */
#define DMA_CH71_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF00128E8u)
/** Alias (User Manual Name) for DMA_CH71_SADR.
* To use register names with standard convension, please use DMA_CH71_SADR.
*/
#define DMA_SADR071 (DMA_CH71_SADR)

/** \brief 28EC, DMARAM Channel 71 Destination Address Register */
#define DMA_CH71_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF00128ECu)
/** Alias (User Manual Name) for DMA_CH71_DADR.
* To use register names with standard convension, please use DMA_CH71_DADR.
*/
#define DMA_DADR071 (DMA_CH71_DADR)

/** \brief 28F0, DMARAM Channel 71 Address and Interrupt Control Register */
#define DMA_CH71_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF00128F0u)
/** Alias (User Manual Name) for DMA_CH71_ADICR.
* To use register names with standard convension, please use DMA_CH71_ADICR.
*/
#define DMA_ADICR071 (DMA_CH71_ADICR)

/** \brief 28F4, DMARAM Channel 71 Configuration Register */
#define DMA_CH71_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF00128F4u)
/** Alias (User Manual Name) for DMA_CH71_CHCFGR.
* To use register names with standard convension, please use DMA_CH71_CHCFGR.
*/
#define DMA_CHCFGR071 (DMA_CH71_CHCFGR)

/** \brief 28F8, DMARAM Channel 71 Shadow Address Register */
#define DMA_CH71_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF00128F8u)
/** Alias (User Manual Name) for DMA_CH71_SHADR.
* To use register names with standard convension, please use DMA_CH71_SHADR.
*/
#define DMA_SHADR071 (DMA_CH71_SHADR)

/** \brief 28FC, DMARAM Channel 71 Control and Status Register */
#define DMA_CH71_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF00128FCu)
/** Alias (User Manual Name) for DMA_CH71_CHCSR.
* To use register names with standard convension, please use DMA_CH71_CHCSR.
*/
#define DMA_CHCSR071 (DMA_CH71_CHCSR)

/** \brief 2900, DMARAM Channel 72 Read Data CRC Register */
#define DMA_CH72_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012900u)
/** Alias (User Manual Name) for DMA_CH72_RDCRCR.
* To use register names with standard convension, please use DMA_CH72_RDCRCR.
*/
#define DMA_RDCRCR072 (DMA_CH72_RDCRCR)

/** \brief 2904, DMARAM Channel 72 Source and Destination Address CRC Register */
#define DMA_CH72_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012904u)
/** Alias (User Manual Name) for DMA_CH72_SDCRCR.
* To use register names with standard convension, please use DMA_CH72_SDCRCR.
*/
#define DMA_SDCRCR072 (DMA_CH72_SDCRCR)

/** \brief 2908, DMARAM Channel 72 Source Address Register */
#define DMA_CH72_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012908u)
/** Alias (User Manual Name) for DMA_CH72_SADR.
* To use register names with standard convension, please use DMA_CH72_SADR.
*/
#define DMA_SADR072 (DMA_CH72_SADR)

/** \brief 290C, DMARAM Channel 72 Destination Address Register */
#define DMA_CH72_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF001290Cu)
/** Alias (User Manual Name) for DMA_CH72_DADR.
* To use register names with standard convension, please use DMA_CH72_DADR.
*/
#define DMA_DADR072 (DMA_CH72_DADR)

/** \brief 2910, DMARAM Channel 72 Address and Interrupt Control Register */
#define DMA_CH72_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012910u)
/** Alias (User Manual Name) for DMA_CH72_ADICR.
* To use register names with standard convension, please use DMA_CH72_ADICR.
*/
#define DMA_ADICR072 (DMA_CH72_ADICR)

/** \brief 2914, DMARAM Channel 72 Configuration Register */
#define DMA_CH72_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012914u)
/** Alias (User Manual Name) for DMA_CH72_CHCFGR.
* To use register names with standard convension, please use DMA_CH72_CHCFGR.
*/
#define DMA_CHCFGR072 (DMA_CH72_CHCFGR)

/** \brief 2918, DMARAM Channel 72 Shadow Address Register */
#define DMA_CH72_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012918u)
/** Alias (User Manual Name) for DMA_CH72_SHADR.
* To use register names with standard convension, please use DMA_CH72_SHADR.
*/
#define DMA_SHADR072 (DMA_CH72_SHADR)

