Infineon/AURIX_code_examples/code_examples/OneEye_DAS_Shell_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxDma_reg.h
/** \brief 2A88, DMARAM Channel 84 Source Address Register */
#define DMA_CH84_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012A88u)
/** Alias (User Manual Name) for DMA_CH84_SADR.
* To use register names with standard convension, please use DMA_CH84_SADR.
*/
#define DMA_SADR084 (DMA_CH84_SADR)

/** \brief 2A8C, DMARAM Channel 84 Destination Address Register */
#define DMA_CH84_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012A8Cu)
/** Alias (User Manual Name) for DMA_CH84_DADR.
* To use register names with standard convension, please use DMA_CH84_DADR.
*/
#define DMA_DADR084 (DMA_CH84_DADR)

/** \brief 2A90, DMARAM Channel 84 Address and Interrupt Control Register */
#define DMA_CH84_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012A90u)
/** Alias (User Manual Name) for DMA_CH84_ADICR.
* To use register names with standard convension, please use DMA_CH84_ADICR.
*/
#define DMA_ADICR084 (DMA_CH84_ADICR)

/** \brief 2A94, DMARAM Channel 84 Configuration Register */
#define DMA_CH84_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012A94u)
/** Alias (User Manual Name) for DMA_CH84_CHCFGR.
* To use register names with standard convension, please use DMA_CH84_CHCFGR.
*/
#define DMA_CHCFGR084 (DMA_CH84_CHCFGR)

/** \brief 2A98, DMARAM Channel 84 Shadow Address Register */
#define DMA_CH84_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012A98u)
/** Alias (User Manual Name) for DMA_CH84_SHADR.
* To use register names with standard convension, please use DMA_CH84_SHADR.
*/
#define DMA_SHADR084 (DMA_CH84_SHADR)

/** \brief 2A9C, DMARAM Channel 84 Control and Status Register */
#define DMA_CH84_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012A9Cu)
/** Alias (User Manual Name) for DMA_CH84_CHCSR.
* To use register names with standard convension, please use DMA_CH84_CHCSR.
*/
#define DMA_CHCSR084 (DMA_CH84_CHCSR)

/** \brief 2AA0, DMARAM Channel 85 Read Data CRC Register */
#define DMA_CH85_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012AA0u)
/** Alias (User Manual Name) for DMA_CH85_RDCRCR.
* To use register names with standard convension, please use DMA_CH85_RDCRCR.
*/
#define DMA_RDCRCR085 (DMA_CH85_RDCRCR)

/** \brief 2AA4, DMARAM Channel 85 Source and Destination Address CRC Register */
#define DMA_CH85_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012AA4u)
/** Alias (User Manual Name) for DMA_CH85_SDCRCR.
* To use register names with standard convension, please use DMA_CH85_SDCRCR.
*/
#define DMA_SDCRCR085 (DMA_CH85_SDCRCR)

/** \brief 2AA8, DMARAM Channel 85 Source Address Register */
#define DMA_CH85_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012AA8u)
/** Alias (User Manual Name) for DMA_CH85_SADR.
* To use register names with standard convension, please use DMA_CH85_SADR.
*/
#define DMA_SADR085 (DMA_CH85_SADR)

/** \brief 2AAC, DMARAM Channel 85 Destination Address Register */
#define DMA_CH85_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012AACu)
/** Alias (User Manual Name) for DMA_CH85_DADR.
* To use register names with standard convension, please use DMA_CH85_DADR.
*/
#define DMA_DADR085 (DMA_CH85_DADR)

/** \brief 2AB0, DMARAM Channel 85 Address and Interrupt Control Register */
#define DMA_CH85_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012AB0u)
/** Alias (User Manual Name) for DMA_CH85_ADICR.
* To use register names with standard convension, please use DMA_CH85_ADICR.
*/
#define DMA_ADICR085 (DMA_CH85_ADICR)

/** \brief 2AB4, DMARAM Channel 85 Configuration Register */
#define DMA_CH85_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012AB4u)
/** Alias (User Manual Name) for DMA_CH85_CHCFGR.
* To use register names with standard convension, please use DMA_CH85_CHCFGR.
*/
#define DMA_CHCFGR085 (DMA_CH85_CHCFGR)

/** \brief 2AB8, DMARAM Channel 85 Shadow Address Register */
#define DMA_CH85_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012AB8u)
/** Alias (User Manual Name) for DMA_CH85_SHADR.
* To use register names with standard convension, please use DMA_CH85_SHADR.
*/
#define DMA_SHADR085 (DMA_CH85_SHADR)

/** \brief 2ABC, DMARAM Channel 85 Control and Status Register */
#define DMA_CH85_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012ABCu)
/** Alias (User Manual Name) for DMA_CH85_CHCSR.
* To use register names with standard convension, please use DMA_CH85_CHCSR.
*/
#define DMA_CHCSR085 (DMA_CH85_CHCSR)

/** \brief 2AC0, DMARAM Channel 86 Read Data CRC Register */
#define DMA_CH86_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012AC0u)
/** Alias (User Manual Name) for DMA_CH86_RDCRCR.
* To use register names with standard convension, please use DMA_CH86_RDCRCR.
*/
#define DMA_RDCRCR086 (DMA_CH86_RDCRCR)

/** \brief 2AC4, DMARAM Channel 86 Source and Destination Address CRC Register */
#define DMA_CH86_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012AC4u)
/** Alias (User Manual Name) for DMA_CH86_SDCRCR.
* To use register names with standard convension, please use DMA_CH86_SDCRCR.
*/
#define DMA_SDCRCR086 (DMA_CH86_SDCRCR)

/** \brief 2AC8, DMARAM Channel 86 Source Address Register */
#define DMA_CH86_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012AC8u)
/** Alias (User Manual Name) for DMA_CH86_SADR.
* To use register names with standard convension, please use DMA_CH86_SADR.
*/
#define DMA_SADR086 (DMA_CH86_SADR)

/** \brief 2ACC, DMARAM Channel 86 Destination Address Register */
#define DMA_CH86_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012ACCu)
/** Alias (User Manual Name) for DMA_CH86_DADR.
* To use register names with standard convension, please use DMA_CH86_DADR.
*/
#define DMA_DADR086 (DMA_CH86_DADR)

/** \brief 2AD0, DMARAM Channel 86 Address and Interrupt Control Register */
#define DMA_CH86_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012AD0u)
/** Alias (User Manual Name) for DMA_CH86_ADICR.
* To use register names with standard convension, please use DMA_CH86_ADICR.
*/
#define DMA_ADICR086 (DMA_CH86_ADICR)

/** \brief 2AD4, DMARAM Channel 86 Configuration Register */
#define DMA_CH86_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012AD4u)
/** Alias (User Manual Name) for DMA_CH86_CHCFGR.
* To use register names with standard convension, please use DMA_CH86_CHCFGR.
*/
#define DMA_CHCFGR086 (DMA_CH86_CHCFGR)

/** \brief 2AD8, DMARAM Channel 86 Shadow Address Register */
#define DMA_CH86_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012AD8u)
/** Alias (User Manual Name) for DMA_CH86_SHADR.
* To use register names with standard convension, please use DMA_CH86_SHADR.
*/
#define DMA_SHADR086 (DMA_CH86_SHADR)

/** \brief 2ADC, DMARAM Channel 86 Control and Status Register */
#define DMA_CH86_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012ADCu)
/** Alias (User Manual Name) for DMA_CH86_CHCSR.
* To use register names with standard convension, please use DMA_CH86_CHCSR.
*/
#define DMA_CHCSR086 (DMA_CH86_CHCSR)

/** \brief 2AE0, DMARAM Channel 87 Read Data CRC Register */
#define DMA_CH87_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012AE0u)
/** Alias (User Manual Name) for DMA_CH87_RDCRCR.
* To use register names with standard convension, please use DMA_CH87_RDCRCR.
*/
#define DMA_RDCRCR087 (DMA_CH87_RDCRCR)

