Infineon/AURIX_code_examples/code_examples/OneEye_DAS_Shell_1_KIT_TC375_LK/Libraries/Infra/Sfr/TC37x/IfxDma_reg.h
/** \brief 2BDC, DMARAM Channel 94 Control and Status Register */
#define DMA_CH94_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012BDCu)
/** Alias (User Manual Name) for DMA_CH94_CHCSR.
* To use register names with standard convension, please use DMA_CH94_CHCSR.
*/
#define DMA_CHCSR094 (DMA_CH94_CHCSR)

/** \brief 2BE0, DMARAM Channel 95 Read Data CRC Register */
#define DMA_CH95_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012BE0u)
/** Alias (User Manual Name) for DMA_CH95_RDCRCR.
* To use register names with standard convension, please use DMA_CH95_RDCRCR.
*/
#define DMA_RDCRCR095 (DMA_CH95_RDCRCR)

/** \brief 2BE4, DMARAM Channel 95 Source and Destination Address CRC Register */
#define DMA_CH95_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012BE4u)
/** Alias (User Manual Name) for DMA_CH95_SDCRCR.
* To use register names with standard convension, please use DMA_CH95_SDCRCR.
*/
#define DMA_SDCRCR095 (DMA_CH95_SDCRCR)

/** \brief 2BE8, DMARAM Channel 95 Source Address Register */
#define DMA_CH95_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012BE8u)
/** Alias (User Manual Name) for DMA_CH95_SADR.
* To use register names with standard convension, please use DMA_CH95_SADR.
*/
#define DMA_SADR095 (DMA_CH95_SADR)

/** \brief 2BEC, DMARAM Channel 95 Destination Address Register */
#define DMA_CH95_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012BECu)
/** Alias (User Manual Name) for DMA_CH95_DADR.
* To use register names with standard convension, please use DMA_CH95_DADR.
*/
#define DMA_DADR095 (DMA_CH95_DADR)

/** \brief 2BF0, DMARAM Channel 95 Address and Interrupt Control Register */
#define DMA_CH95_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012BF0u)
/** Alias (User Manual Name) for DMA_CH95_ADICR.
* To use register names with standard convension, please use DMA_CH95_ADICR.
*/
#define DMA_ADICR095 (DMA_CH95_ADICR)

/** \brief 2BF4, DMARAM Channel 95 Configuration Register */
#define DMA_CH95_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012BF4u)
/** Alias (User Manual Name) for DMA_CH95_CHCFGR.
* To use register names with standard convension, please use DMA_CH95_CHCFGR.
*/
#define DMA_CHCFGR095 (DMA_CH95_CHCFGR)

/** \brief 2BF8, DMARAM Channel 95 Shadow Address Register */
#define DMA_CH95_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012BF8u)
/** Alias (User Manual Name) for DMA_CH95_SHADR.
* To use register names with standard convension, please use DMA_CH95_SHADR.
*/
#define DMA_SHADR095 (DMA_CH95_SHADR)

/** \brief 2BFC, DMARAM Channel 95 Control and Status Register */
#define DMA_CH95_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012BFCu)
/** Alias (User Manual Name) for DMA_CH95_CHCSR.
* To use register names with standard convension, please use DMA_CH95_CHCSR.
*/
#define DMA_CHCSR095 (DMA_CH95_CHCSR)

/** \brief 2C00, DMARAM Channel 96 Read Data CRC Register */
#define DMA_CH96_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012C00u)
/** Alias (User Manual Name) for DMA_CH96_RDCRCR.
* To use register names with standard convension, please use DMA_CH96_RDCRCR.
*/
#define DMA_RDCRCR096 (DMA_CH96_RDCRCR)

/** \brief 2C04, DMARAM Channel 96 Source and Destination Address CRC Register */
#define DMA_CH96_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012C04u)
/** Alias (User Manual Name) for DMA_CH96_SDCRCR.
* To use register names with standard convension, please use DMA_CH96_SDCRCR.
*/
#define DMA_SDCRCR096 (DMA_CH96_SDCRCR)

/** \brief 2C08, DMARAM Channel 96 Source Address Register */
#define DMA_CH96_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012C08u)
/** Alias (User Manual Name) for DMA_CH96_SADR.
* To use register names with standard convension, please use DMA_CH96_SADR.
*/
#define DMA_SADR096 (DMA_CH96_SADR)

/** \brief 2C0C, DMARAM Channel 96 Destination Address Register */
#define DMA_CH96_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012C0Cu)
/** Alias (User Manual Name) for DMA_CH96_DADR.
* To use register names with standard convension, please use DMA_CH96_DADR.
*/
#define DMA_DADR096 (DMA_CH96_DADR)

/** \brief 2C10, DMARAM Channel 96 Address and Interrupt Control Register */
#define DMA_CH96_ADICR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_ADICR*)0xF0012C10u)
/** Alias (User Manual Name) for DMA_CH96_ADICR.
* To use register names with standard convension, please use DMA_CH96_ADICR.
*/
#define DMA_ADICR096 (DMA_CH96_ADICR)

/** \brief 2C14, DMARAM Channel 96 Configuration Register */
#define DMA_CH96_CHCFGR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCFGR*)0xF0012C14u)
/** Alias (User Manual Name) for DMA_CH96_CHCFGR.
* To use register names with standard convension, please use DMA_CH96_CHCFGR.
*/
#define DMA_CHCFGR096 (DMA_CH96_CHCFGR)

/** \brief 2C18, DMARAM Channel 96 Shadow Address Register */
#define DMA_CH96_SHADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SHADR*)0xF0012C18u)
/** Alias (User Manual Name) for DMA_CH96_SHADR.
* To use register names with standard convension, please use DMA_CH96_SHADR.
*/
#define DMA_SHADR096 (DMA_CH96_SHADR)

/** \brief 2C1C, DMARAM Channel 96 Control and Status Register */
#define DMA_CH96_CHCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_CHCSR*)0xF0012C1Cu)
/** Alias (User Manual Name) for DMA_CH96_CHCSR.
* To use register names with standard convension, please use DMA_CH96_CHCSR.
*/
#define DMA_CHCSR096 (DMA_CH96_CHCSR)

/** \brief 2C20, DMARAM Channel 97 Read Data CRC Register */
#define DMA_CH97_RDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_RDCRCR*)0xF0012C20u)
/** Alias (User Manual Name) for DMA_CH97_RDCRCR.
* To use register names with standard convension, please use DMA_CH97_RDCRCR.
*/
#define DMA_RDCRCR097 (DMA_CH97_RDCRCR)

/** \brief 2C24, DMARAM Channel 97 Source and Destination Address CRC Register */
#define DMA_CH97_SDCRCR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SDCRCR*)0xF0012C24u)
/** Alias (User Manual Name) for DMA_CH97_SDCRCR.
* To use register names with standard convension, please use DMA_CH97_SDCRCR.
*/
#define DMA_SDCRCR097 (DMA_CH97_SDCRCR)

/** \brief 2C28, DMARAM Channel 97 Source Address Register */
#define DMA_CH97_SADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_SADR*)0xF0012C28u)
/** Alias (User Manual Name) for DMA_CH97_SADR.
* To use register names with standard convension, please use DMA_CH97_SADR.
*/
#define DMA_SADR097 (DMA_CH97_SADR)

/** \brief 2C2C, DMARAM Channel 97 Destination Address Register */
#define DMA_CH97_DADR /*lint --e(923, 9078)*/ (*(volatile Ifx_DMA_CH_DADR*)0xF0012C2Cu)
/** Alias (User Manual Name) for DMA_CH97_DADR.
* To use register names with standard convension, please use DMA_CH97_DADR.
*/
#define DMA_DADR097 (DMA_CH97_DADR)

